# Version:1.0 MMMC View Definition File
# Do Not Remove Above Line
create_rc_corner -name Default_rc_corner -preRoute_res {1.0} -preRoute_cap {1.0} -preRoute_clkres {0.0} -preRoute_clkcap {0.0} -postRoute_res {1.0} -postRoute_cap {1.0} -postRoute_xcap {1.0} -postRoute_clkres {0.0} -postRoute_clkcap {0.0} -cap_table {/afs/iitd.ac.in/user/e/ee/een202501/Music/counter_design_database_45nm/captable/cln28hpl_1p10m+alrdl_5x2yu2yz_typical.capTbl}
create_library_set -name typ_time_library -timing {/afs/iitd.ac.in/service/tools/public/asiclib/umcoa/L65/libraries/UMC65LLSC/synopsys/ccs/uk65lscllmvbbr_100c25_tc_ccs.lib}
create_constraint_mode -name fifo_constraints -sdc_files {/afs/iitd.ac.in/user/j/jv/jvl202215/elp736/assignments/assignment2/synth/sdc/fifo.sdc}
create_delay_corner -name typ_delay_corner -library_set {typ_time_library} -rc_corner {Default_rc_corner}
create_analysis_view -name typ_case -constraint_mode {fifo_constraints} -delay_corner {typ_delay_corner}
set_analysis_view -setup {typ_case} -hold {typ_case}
