###############################################################
#  Generated by:      Cadence Innovus 16.26-s040_1
#  OS:                Linux x86_64(Host ID bessel1)
#  Generated on:      Thu Apr  7 04:20:58 2022
#  Design:            fifo
#  Command:           saveDesign fifo_postRoute
###############################################################
current_design fifo
create_clock [get_ports {rclk}]  -name rclk -period 33.330000 -waveform {0.000000 16.665000}
set_clock_transition  -rise -min 0.4 [get_clocks {rclk}]
set_clock_transition  -rise -max 0.4 [get_clocks {rclk}]
set_clock_transition  -fall -min 0.4 [get_clocks {rclk}]
set_clock_transition  -fall -max 0.4 [get_clocks {rclk}]
create_clock [get_ports {wclk}]  -name wclk -period 100.000000 -waveform {0.000000 50.000000}
set_clock_transition  -rise -min 0.4 [get_clocks {wclk}]
set_clock_transition  -rise -max 0.4 [get_clocks {wclk}]
set_clock_transition  -fall -min 0.4 [get_clocks {wclk}]
set_clock_transition  -fall -max 0.4 [get_clocks {wclk}]
set_propagated_clock  [get_ports {rclk}]
set_propagated_clock  [get_ports {wclk}]
set_max_transition 3  [get_ports {rdata[7]}]
set_max_transition 3  [get_ports {rdata[6]}]
set_max_transition 3  [get_ports {rdata[5]}]
set_max_transition 3  [get_ports {rdata[4]}]
set_max_transition 3  [get_ports {rdata[3]}]
set_max_transition 3  [get_ports {rdata[2]}]
set_max_transition 3  [get_ports {rdata[1]}]
set_max_transition 3  [get_ports {rdata[0]}]
set_max_transition 3  [get_ports {wfull}]
set_max_transition 3  [get_ports {rempty}]
set_max_transition 3  [get_ports {wdata[7]}]
set_max_transition 3  [get_ports {wdata[6]}]
set_max_transition 3  [get_ports {wdata[5]}]
set_max_transition 3  [get_ports {wdata[4]}]
set_max_transition 3  [get_ports {wdata[3]}]
set_max_transition 3  [get_ports {wdata[2]}]
set_max_transition 3  [get_ports {wdata[1]}]
set_max_transition 3  [get_ports {wdata[0]}]
set_max_transition 3  [get_ports {winc}]
set_max_capacitance 0.5  [get_ports {wclk}]
set_max_transition 3  [get_ports {wclk}]
set_max_transition 2  [get_ports {wrst_n}]
set_max_transition 3  [get_ports {rinc}]
set_max_capacitance 0.45  [get_ports {rclk}]
set_max_transition 3  [get_ports {rclk}]
set_max_transition 2  [get_ports {rrst_n}]
set_max_capacitance 2  [get_designs {fifo}]
set_input_delay -add_delay 0.0001 -clock [get_clocks {wclk}] [get_ports {wrst_n}]
set_input_delay -add_delay 0.0001 -clock [get_clocks {rclk}] [get_ports {rrst_n}]
set_input_delay -add_delay 0.0001 -clock [get_clocks {wclk}] [get_ports {wdata[6]}]
set_input_delay -add_delay 0.0001 -clock [get_clocks {wclk}] [get_ports {wdata[4]}]
set_input_delay -add_delay 0.0001 -clock [get_clocks {wclk}] [get_ports {wdata[2]}]
set_input_delay -add_delay 0.0001 -clock [get_clocks {wclk}] [get_ports {wdata[0]}]
set_input_delay -add_delay 0.0001 -clock [get_clocks {rclk}] [get_ports {rinc}]
set_input_delay -add_delay 0.0001 -clock [get_clocks {wclk}] [get_ports {wdata[7]}]
set_input_delay -add_delay 0.0001 -clock [get_clocks {wclk}] [get_ports {wdata[5]}]
set_input_delay -add_delay 0.0001 -clock [get_clocks {wclk}] [get_ports {wdata[3]}]
set_input_delay -add_delay 0.0001 -clock [get_clocks {wclk}] [get_ports {wdata[1]}]
set_input_delay -add_delay 0.0001 -clock [get_clocks {wclk}] [get_ports {winc}]
set_output_delay -add_delay 0.0001 -clock [get_clocks {rclk}] [get_ports {rdata[7]}]
set_output_delay -add_delay 0.0001 -clock [get_clocks {rclk}] [get_ports {rdata[5]}]
set_output_delay -add_delay 0.0001 -clock [get_clocks {rclk}] [get_ports {rdata[3]}]
set_output_delay -add_delay 0.0001 -clock [get_clocks {rclk}] [get_ports {rdata[1]}]
set_output_delay -add_delay 0.0001 -clock [get_clocks {rclk}] [get_ports {rempty}]
set_output_delay -add_delay 0.0001 -clock [get_clocks {rclk}] [get_ports {rdata[6]}]
set_output_delay -add_delay 0.0001 -clock [get_clocks {rclk}] [get_ports {rdata[4]}]
set_output_delay -add_delay 0.0001 -clock [get_clocks {rclk}] [get_ports {rdata[2]}]
set_output_delay -add_delay 0.0001 -clock [get_clocks {rclk}] [get_ports {rdata[0]}]
set_output_delay -add_delay 0.0001 -clock [get_clocks {wclk}] [get_ports {wfull}]
set_clock_uncertainty 0.2 -setup [get_clocks {wclk}]
set_clock_uncertainty 0.3 -hold  -from [get_clocks {wclk}] -to [get_clocks {rclk}]
set_clock_groups -name __default_3 -asynchronous  -group  [get_clocks {wclk}] -group  [get_clocks {rclk}]
